feat(content): async asset importer - WIP - Jobs
